src/main/java/com/amdocs/halo/automation/xmls/CNOD_APORT.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cus="http://CustomerOrderEstablishment.ocxGenericServices.services.amdocs.com">
    <soapenv:Header>
        <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:UsernameToken wsu:Id="UsernameToken-1">
                <wsse:Username>OMS</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Oms111</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <cus:createProductOrderForNewProduct>
            <createProductOrderForNewProductRequest>
                <salesChannel>SA</salesChannel>
                <options>
                    <confirmationChecksApproved>true</confirmationChecksApproved>
                    <bulkOrderIndicator>false</bulkOrderIndicator>
                </options>
                <order>
                    <!--Optional:-->
                    <customer>
                        <customerId>892912790506</customerId>
                        <organizationId>1115130</organizationId>
                        <contractId>3305329</contractId>
                        <customerName>Albert Test CR193632</customerName>
                        <saartId>SAART11041</saartId>
                        <customerType>WHOLESALE</customerType>
                    </customer>
                    <description>Using update Add Product to offer.</description>
                    <externalId>Winroom_TXTXH_3434</externalId>
                    <productOfferings>
                        <productOfferingId>6043975</productOfferingId>
                        <topLevelProducts>
                            <associationSpec>
                                <productSpecsId>69573</productSpecsId>
                            </associationSpec>
                            <orderItem>
                                <contacts>
                                    <contactType>CUS</contactType>
                                    <email>hs1650@att.com</email>
                                    <firstName>Sagar</firstName>
                                    <landLinePhone>7736878847</landLinePhone>
                                    <lastName>Patankar</lastName>
                                    <mobilePhone>9856987747</mobilePhone>
                                </contacts>
                                <contacts>
                                    <contactType>BUS</contactType>
                                    <email>hs1650@att.com</email>
                                    <firstName>Sagar</firstName>
                                    <landLinePhone>7736878847</landLinePhone>
                                    <lastName>Patankar</lastName>
                                    <mobilePhone>9856987747</mobilePhone>
                                </contacts>
                                <contacts>
                                    <contactType>ALT</contactType>
                                    <email>hs1650@att.com</email>
                                    <firstName>Sagar</firstName>
                                    <landLinePhone>7736878847</landLinePhone>
                                    <lastName>Patankar</lastName>
                                    <mobilePhone>9856987747</mobilePhone>
                                </contacts>
                                <contacts>
                                    <contactType>LCL</contactType>
                                    <email>hs1650@att.com</email>
                                    <firstName>Sagar</firstName>
                                    <landLinePhone>7736878847</landLinePhone>
                                    <lastName>Patankar</lastName>
                                    <mobilePhone>9856987747</mobilePhone>
                                </contacts>
                                
                                <PromoCode>
                                    <promoCode>PRM444</promoCode>
                                    <billingDiscountId>1616</billingDiscountId>
                                    <rateId>RATE741</rateId>
                                    <discountAmount>100</discountAmount>
                                </PromoCode>
                                <PromoCode>
                                    <promoCode>PRM555</promoCode>
                                    <billingDiscountId>1717</billingDiscountId>
                                    <rateId>RATE852</rateId>
                                    <discountAmount>200</discountAmount>
                                </PromoCode>
                                <PromoCode>
                                    <promoCode>PRM666</promoCode>
                                    <billingDiscountId>1818</billingDiscountId>
                                    <rateId>RATE963</rateId>
                                    <discountAmount>300</discountAmount>
                                </PromoCode>
                                <PromoCode>
                                    <promoCode>PRM777</promoCode>
                                    <billingDiscountId>1919</billingDiscountId>
                                    <rateId>RATE321</rateId>
                                    <discountAmount>400</discountAmount>
                                </PromoCode>
                                
                                
                                <orderActionType>PR</orderActionType>
                                <externalId/>
                                <serviceAdddress>
                                    <locationId>GLID001</locationId>
                                    <city>CHGO</city>
                                    <country>US</country>
                                    <houseNumber>554</houseNumber>
                                    <isoCountryCode>IL</isoCountryCode>
                                    <stateName>554</stateName>
                                    <state>IL</state>
                                    <streetName>Diversey</streetName>
                                    <zipCode>60614-77</zipCode>
                                    <clli8>CHCMILVWN00</clli8>
                                </serviceAdddress>
                                <orderItemAttributes>
                                    <notes>PROVIDE</notes>
                                    <timeZone>tz10849</timeZone>
                                </orderItemAttributes>
                                <serviceRequiredDate>2021-09-13T18:30:00.000+05:30</serviceRequiredDate>
                            </orderItem>
                            <topLevelProduct>
                                <containedProducts>
                                    <action>CHANGE</action>
                                    <associationSpecDefinition>
                                        <componentServiceType>PMN</componentServiceType>
                                    </associationSpecDefinition>
                                    <characteristicValues>
                                        <characteristicDefinition>
                                            <attributeCode>etePortKey</attributeCode>
                                            <attributeId>68593</attributeId>
                                        </characteristicDefinition>
                                        <value>ETEPORTKET0009</value>
                                    </characteristicValues>
                                    <characteristicValues>
                                        <characteristicDefinition>
                                            <attributeCode>portService</attributeCode>
                                            <attributeId>131</attributeId>
                                        </characteristicDefinition>
                                        <value>Ethernet</value>
                                    </characteristicValues>
                                    <characteristicValues>
                                        <characteristicDefinition>
                                            <attributeCode>baseServiceType</attributeCode>
                                            <attributeId>68283</attributeId>
                                        </characteristicDefinition>
                                        <value>AVPN</value>
                                    </characteristicValues>
                                    
                                    <characteristicValues>
                                        <characteristicDefinition>
                                            <attributeCode>portCircuitID</attributeCode>
                                            <attributeId>1931</attributeId>
                                        </characteristicDefinition>
                                        <value>PORTCIRCUITID0009</value>
                                    </characteristicValues>
                                    
                                    <characteristicValues>
                                        <characteristicDefinition>
                                            <attributeCode>serviceFlavor</attributeCode>
                                            <attributeId>67843</attributeId>
                                        </characteristicDefinition>
                                        <value>AVPN ADX</value>
                                    </characteristicValues>
                                    
                                    <characteristicValues>
                                        <characteristicDefinition>
                                            <attributeCode>portAlias</attributeCode>
                                            <attributeId>71553</attributeId>
                                        </characteristicDefinition>
                                        <value>PORTALIAS0009</value>
                                    </characteristicValues>
                                    
                                    <characteristicValues>
                                        <characteristicDefinition>
                                            <attributeCode>TotalRC</attributeCode>
                                            <attributeId>8959</attributeId>
                                        </characteristicDefinition>
                                        <value>TOTALRC0009</value>
                                    </characteristicValues>
                                    <characteristicValues>
                                        <characteristicDefinition>
                                            <attributeCode>TotalOC</attributeCode>
                                            <attributeId>8969</attributeId>
                                        </characteristicDefinition>
                                        <value>TOTALOC0009</value>
                                    </characteristicValues>
                                </containedProducts>
                                <containedProducts>
                                    <action>CHANGE</action>
                                    <associationSpecDefinition>
                                        <componentServiceType>ATRNS</componentServiceType>
                                    </associationSpecDefinition>
                                    <characteristicValues>
                                        <characteristicDefinition>
                                            <attributeCode>icoreSiteID</attributeCode>
                                            <attributeId>5635285</attributeId>
                                        </characteristicDefinition>
                                        <value>27898852</value>
                                    </characteristicValues>
                                    
                                </containedProducts>
                                <containedProducts>
                                    <action>CHANGE</action>
                                    <associationSpecDefinition>
                                        <componentServiceType>PFEA</componentServiceType>
                                    </associationSpecDefinition>
                                    <characteristicValues>
                                        <characteristicDefinition>
                                            <attributeCode>fisArrangement</attributeCode>
                                            <attributeId>6040405</attributeId>
                                        </characteristicDefinition>
                                        <value></value>
                                    </characteristicValues>
                                </containedProducts>
                            </topLevelProduct>
                        </topLevelProducts>
                    </productOfferings>
                    <startOrderingProcess>true</startOrderingProcess>
                    <userId>g31791</userId>
                </order>
            </createProductOrderForNewProductRequest>
        </cus:createProductOrderForNewProduct>
    </soapenv:Body>
</soapenv:Envelope>